{"I am the first teacher my kids see every day, so I try to teach them good morals and values at home.\n": "1. <I, am, the first teacher my kids see every day>\n2. <I, try to teach, them good morals and values at home>", "I need my rest because driving a bus is stressful, and being well-rested helps me manage it.\n": "- <Participant, need, rest>", "My family, especially my kids, have been a positive influence in my life, keeping me sane despite experiencing many deaths around me.\n": "[]", "I try to stay happy, and my kids make me happy, especially when I pick them up from school and they greet me excitedly.\n": "1. <I, try, to stay happy>\n2. <my kids, make, me happy>\n3. <I, pick up, them from school>\n4. <they, greet, me excitedly>", "I believe in learning from mistakes and am currently going back to school to better myself career-wise.\n": "1. <Participant, believe, learning from mistakes>\n2. <Participant, am going back, school>\n3. <Participant, better, myself career-wise>", "To relax, I read, take long walks, have hot baths, meditate, and sometimes just close my eyes.\n": "1. <I, read, >  \n2. <I, take, long walks>  \n3. <I, have, hot baths>  \n4. <I, meditate, >  \n5. <I, close, my eyes>  ", "I am good at controlling my temper because, as a bus operator, I need to remain calm and professional.\n": "[]", "I try to maintain a job and support my kids despite financial challenges.\n": "1. <I, try to maintain, a job>\n2. <I, support, my kids>", "I had an argument with my oldest daughter about her life choices and the changes she needs to make.\n": "1. <I, had, argument>  \n2. <I, argue, daughter>  \n3. <I, discuss, life choices>  \n4. <I, discuss, changes>", "I felt happy when I accomplished something, even though I had to leave school due to a car accident and financial needs as a young parent.\n": "1. <I, felt, happy>\n2. <I, accomplished, something>\n3. <I, had to leave, school>", "I find parenting challenging, especially as a single parent, and strive to set a good example for my kids.\n": "1. <Participant, find, parenting challenging>\n2. <Participant, strive, set a good example for kids>", "I don't like the traffic and violence rate in L.A., but I stay informed about my environment.\n": "1. <I, don't like, traffic and violence rate in L.A.>\n2. <I, stay informed, my environment>", "I studied sociology and have a two-year degree in liberal arts.\n": "1. <I, studied, sociology>\n2. <I, have, two-year degree in liberal arts>", "I am currently an M.T.A. bus operator.\n": "[]", "I don't have a best friend, but someone I used to work with would describe me as outgoing, dependable, and a people person.\n": "[]", "I have trained my kids to go to bed early to ensure they and I get a good night's rest.\n": "1. <Participant, train, kids>"}