{"I have been having trouble sleeping for about a year due to racing thoughts and worries about finding work.\n": "1. <Participant, have been having, trouble sleeping>\n2. <Participant, worry about, finding work>", "I was born in Glendale, California, and I'm currently unhappy with my living situation because I'm unemployed but actively seeking work.\n": "1. <Participant, was born, Glendale, California>\n2. <Participant, is, unhappy with living situation>\n3. <Participant, is, unemployed>\n4. <Participant, is seeking, work>", "I used to go to therapy and miss it, but I stopped due to monetary reasons and lack of health insurance.\n": "1. <Participant, used to go, therapy>\n2. <Participant, miss, therapy>\n3. <Participant, stopped, therapy>", "I have a past history that affects my job prospects, and I have to look for employers who are felony-friendly.\n": "1. <I, have, past history>\n2. <past history, affects, job prospects>\n3. <I, have to look for, employers who are felony-friendly>", "I was diagnosed with bipolar disorder and have been on various medications, but I stopped taking them about three years ago.\n": "1. <Participant, was diagnosed with, bipolar disorder>\n2. <Participant, have been on, various medications>\n3. <Participant, stopped taking, medications>", "I lost my job as a truck driver after getting a DUI last year, which significantly impacted my life.\n": "1. <Participant, lost, job>", "I enjoy activities like going to the beach, painting, fishing, and driving a truck, but I haven't done some of these in a while.\n": "1. <I, enjoy, activities>\n2. <I, go, beach>\n3. <I, paint, >\n4. <I, fish, >\n5. <I, drive, truck>", "I applied for a job at Ralphs and hope to get it, but my dream job would be working for the forestry service.\n": "1. <I, applied for, a job at Ralphs>", "I had an argument with my girlfriend about honesty, which is very important to me.\n": "1. <Participant, have, argument with girlfriend>", "I cope with life's challenges by trying not to think about things I can't control and focusing on actively looking for work.\n": "1. <I, cope, life's challenges>\n2. <I, try, not to think about things I can't control>\n3. <I, focus, actively looking for work>"}