{"I have not been medically diagnosed with depression or PTSD, and I have never served in the military.\n": "[]", "I struggle with controlling my temper, especially with my family and boyfriend, but I manage better with people I don't know well.\n": "1. <I, struggle with, controlling my temper>\n2. <I, manage better, with people I don't know well>", "I am stressed about financial situations, including school loans, rent, and groceries, despite having a good college education.\n": "1. <Participant, be stressed about, financial situations>", "I used to travel a lot with my family, visiting seven or eight different countries and living in three or four.\n": "1. <I, used to travel, a lot with my family>\n2. <I, visit, seven or eight different countries>\n3. <I, live, in three or four countries>", "I have been feeling more negative since quitting my full-time job five months ago and not finding anything else I'm interested in.\n": "1. <Participant, quit, full-time job>", "I haven't seen my friends in two weeks due to one having a car accident and the other working late.\n": "[]", "I feel down sometimes, but I'm going to Hawaii next week, which makes me feel better.\n": "1. <Participant, feel, down>\n2. <Participant, go, Hawaii>", "I used to act and write stories when I was younger but stopped because I didn't think I was good at it.\n": "1. <Participant, act, stories>\n2. <Participant, write, stories>\n3. <Participant, stop, act and write stories>", "I felt really happy when my boyfriend took me on a sailing trip in San Clemente.\n": "- <boyfriend, took, participant>", "I relax by watching TV, although I used to read, listen to music, or bake.\n": "[]", "I feel pressure comparing myself to friends who have prestigious jobs or are in advanced education programs.\n": "[]", "My living situation with two roommates involves some drama, but we've learned to live together after a year.\n": "[]", "I argued with my boyfriend about him not following through on being healthy and saving money.\n": "1. <I, argued, with my boyfriend>", "I quit my full-time job because I hated it and now work in a restaurant while looking for a second job.\n": "1. <Participant, quit, full-time job>\n2. <Participant, work, restaurant>\n3. <Participant, look for, second job>", "I am superficially close to my family, relying on them for school and work matters but not personal issues.\n": "1. <Participant, rely, family for school and work matters>", "I sleep easily, but when I don't, I become grumpy and lethargic.\n": "[]", "I moved to LA for college after my family moved to the U.S., and it took a while to adjust to living there.\n": "1. <I, moved, LA>\n2. <I, moved, U.S.>\n3. <it, took, while>", "For fun, I enjoy going out with friends, dancing, biking, hiking, and photography.\n": "1. <Participant, enjoy, going out with friends>\n2. <Participant, enjoy, dancing>\n3. <Participant, enjoy, biking>\n4. <Participant, enjoy, hiking>\n5. <Participant, enjoy, photography>"}