{"I was in a relationship with someone who was my girlfriend at the time.\n": "[]", "I currently have roommates, but I dislike the living situation.\n": "1. <Participant, have, roommates>\n2. <Participant, dislike, living situation>", "I quit going to school because my interests were elsewhere.\n": "1. <Participant, quit, going to school>", "I haven't flown on an airplane since December of 1986 or 1987 because I can't stand airplanes.\n": "1. <Participant, haven't flown, airplane>", "I took basic general studies at a junior college but didn't finish because I quit to play in a band.\n": "1. <I, took, basic general studies>\n2. <I, quit, to play in a band>", "I usually travel from L.A. to Seattle and then to Vancouver by train.\n": "- <Participant, travel, from L.A. to Seattle>\n- <Participant, travel, from Seattle to Vancouver>", "I am not close to my family.\n": "[]", "My dream job is to open up a record shop.\n": "No clear event related to the participant can be extracted from this sentence.", "I am an unemployed office worker right now.\n": "[]", "I didn't fall into drugs like many people I know.\n": "1. <Participant, not fall into, drugs>", "Listening to music on vinyl and being around dogs put me in a good mood.\n": "[]", "I live in Hollywood but am originally from Seattle.\n": "[]", "I moved to L.A. because I needed a change of scenery.\n": "1. <I, moved, L.A.>\n2. <I, needed, change of scenery>", "I consider myself an introvert.\n": "[]", "I don't lash out physically at people but might punch a wall to let off steam.\n": "- <Participant, punch, wall>", "I like to be alone to relax, sometimes reading or doing nothing.\n": "[]", "I don't have a best friend these days.\n": "[]", "I argue with people online about trivial things but haven't argued face-to-face in a long time.\n": "1. <I, argue, people online>", "I don't have any kids and am glad about it because kids in Los Angeles drive me nuts.\n": "[]", "I feel down often but wouldn't necessarily call it being down; I'm not sure when I last felt really happy.\n": "[]"}