{"Twenty years ago, I was fifteen, and I would advise myself to keep doing what I was doing because it worked out well for me.\n": "[]", "I feel happy when I have a good workout, do well in video games, or when my research in mathematics or physics goes well.\n": "[]", "I started off in school reading about Einstein and got interested in particle physics and quantum mechanics, eventually realizing I could do research in physics and contribute to scientific knowledge.\n": "1. <I, started, reading about Einstein>\n2. <I, got interested, particle physics and quantum mechanics>\n3. <I, realized, I could do research in physics>\n4. <I, contribute, scientific knowledge>", "Serving in the military didn't change me much because I grew up expecting it, and after the military, I went to graduate school in physics.\n": "1. <Participant, serve, military>\n2. <Participant, go, graduate school in physics>", "I teach community college physics and astronomy, do research in physics, and plan to go back to grad school.\n": "1. <I, teach, community college physics and astronomy>\n2. <I, do, research in physics>\n3. <I, plan, go back to grad school>", "I am most proud of the research I have done and making it this far in my research career.\n": "1. <I, am proud of, the research I have done>\n2. <I, am proud of, making it this far in my research career>", "I am really good at math, patient, and disciplined, spending many hours reading books that might be important.\n": "1. <Participant, spend, hours reading books>", "A few weeks ago, I felt really happy when I got a good grade in a class.\n": "1. <Participant, felt, happy>\n2. <Participant, got, good grade>", "I am applying to grad school again, feeling apprehensive but hopeful.\n": "1. <Participant, apply, grad school>", "I argued with my brother about video games, which is a rare occurrence since I'm single and don't argue much.\n": "1. <I, argued, with my brother>", "I am fairly close to my family, seeing my parents and brother often and tutoring my sister's kids.\n": "1. <Participant, see, parents>\n2. <Participant, see, brother>\n3. <Participant, tutor, sister's kids>", "I am introverted, spending long periods doing math and reading, and I relax by playing video games and working out.\n": "1. <Participant, spend, long periods doing math and reading>\n2. <Participant, relax, by playing video games>\n3. <Participant, relax, by working out>", "I used to travel a lot for school conferences but not as much now, and I don't enjoy traveling.\n": "1. <I, used to travel, a lot for school conferences>\n2. <I, don't enjoy, traveling>"}