{"I moved to Los Angeles for business 26 years ago and found it very easy to get used to living there.\n": "1. <I, moved, Los Angeles>\n2. <I, found, it very easy to get used to living there>", "I have a teaching degree and an art degree, and my dream job is designing for the movie industry, but I found it extremely hard to pursue.\n": "1. <Participant, have, teaching degree>\n2. <Participant, have, art degree>\n3. <Participant, found, it extremely hard to pursue>", "I am very close to my family, and I push myself to get out of the house and try to enjoy life more since going to therapy.\n": "1. <I, push, myself>\n2. <I, try, to enjoy life more>", "I recently went to the movies and enjoyed watching \"Life of Pi\" and \"Anna Karenina.\"\n": "1. <Participant, went, movies>\n2. <Participant, enjoyed, watching \"Life of Pi\">\n3. <Participant, enjoyed, watching \"Anna Karenina\">", "I regret not going further in my education, like getting a master's or a Ph.D., which I believe would have made my job search easier.\n": "1. <Participant, regret, not going further in education>", "I was diagnosed with depression a couple of years ago after feeling not energized and down, especially after my parents' illnesses and passing.\n": "1. <Participant, was diagnosed with, depression>", "I enjoy traveling and recently visited New York, which was exhilarating and made me fall in love with the city again.\n": "1. <I, enjoy, traveling>\n2. <I, visited, New York>\n3. <I, fall in love with, the city>", "I like being around the arts and creative people, and I enjoy activities like swimming, visiting museums, and attending plays and concerts.\n": "1. <Participant, like, being around the arts and creative people>\n2. <Participant, enjoy, activities like swimming>\n3. <Participant, enjoy, visiting museums>\n4. <Participant, enjoy, attending plays and concerts>", "I argued with my sister about Obama's handling of the fiscal cliff, which I was against.\n": "1. <I, argued, with my sister>", "I am proud of being a kind, considerate, and helpful person, and I strive to be better to myself.\n": "[]"}