{"I just lost my dad, my last parent, and there's been a lot going on in my life.\n": "1. <Participant, lost, dad>", "I would advise my younger self to listen to the older people in my life who cared about me and wanted to guide me in the right direction.\n": "1. <Participant, advise, younger self>\n2. <Participant, listen, older people>", "I am very proud of my kids.\n": "[]", "I have been going to therapy, but I find it hard to talk about the changes I've noticed.\n": "1. <Participant, have been going, therapy>\n2. <Participant, find, it hard to talk about the changes>", "It's been a while since I felt really happy, maybe a year and a half.\n": "No clear event can be extracted from the given sentence.", "One of my most memorable experiences is my children being born, each birth was special and unique.\n": "[]", "I try to remove myself from situations that annoy me and have gotten better at controlling my temper over the years.\n": "1. <I, try to remove, myself from situations that annoy me>\n2. <I, have gotten better at controlling, my temper>", "Watching TV is how I relax now.\n": "[]", "I like sports, especially watching a good game, and I'm a long-time fan of USC football.\n": "[]", "I sought help because I recognized there were things wrong with me, like feeling tired and lethargic.\n": "1. <I, sought, help>", "My mother was a positive influence in my life, but she passed away ten years ago.\n": "[]", "I have many regrets, too many to name and number.\n": "[]", "I still go to therapy once a month and find it helpful.\n": "1. <Participant, go, therapy>\n2. <Participant, find, it helpful>", "The best thing about being a parent is seeing my children grow up to be successful, but I worry about them all the time.\n": "No clear event related to the participant can be extracted from the given sentence.", "I'm originally from Los Angeles and like the familiarity of the city, but it's so spread out and hard to get places.\n": "[]", "I don't have a dream job and am currently unemployed.\n": "1. <Participant, have, no dream job>\n2. <Participant, am, unemployed>", "I don't travel much anymore due to lack of funds and health issues.\n": "[]", "I was diagnosed with depression about a year ago.\n": "[]"}