{"I graduated and have been thinking about my dream job, possibly managing a research project or a preserve in tropical marine ecology.\n": "1. <Participant, graduated, None>\n2. <Participant, have been thinking about, dream job>\n3. <Participant, possibly managing, research project or a preserve in tropical marine ecology>", "I traveled for eight months in Central America, visiting different countries and scuba diving.\n": "1. <I, traveled, Central America>\n2. <I, visited, different countries>\n3. <I, scuba diving, >", "I was diagnosed with depression at fifteen, which was about seventeen years ago.\n": "1. <Participant, was diagnosed with, depression>", "I stopped going to therapy about three years ago because I didn't enjoy the relationship with my therapist, but I still see a psychiatrist for medication checks.\n": "1. <I, stopped going, therapy>\n2. <I, didn't enjoy, relationship with my therapist>\n3. <I, see, psychiatrist for medication checks>", "I have trouble sleeping and have been taking trazodone for about four years to help with that.\n": "1. <Participant, have, trouble sleeping>\n2. <Participant, have been taking, trazodone>", "I studied marine biology after initially studying graphic design, which I found unfulfilling.\n": "1. <Participant, studied, marine biology>\n2. <Participant, studied, graphic design>\n3. <Participant, found, graphic design unfulfilling>", "I felt really happy on New Year's Eve when I took a trip to Palm Springs and Joshua Tree with my boyfriend and friends.\n": "1. <I, felt, happy>\n2. <I, took, trip>", "I am proud of being a kind person who cares about others and wants to make the world a better place.\n": "[]", "I had a memorable experience diving the Blue Hole in Belize with friends.\n": "1. <I, have, experience>", "I sought help after a friend called my parents about my self-harming behavior, leading to treatment.\n": "1. <Participant, sought, help>  \n2. <Friend, called, parents>  \n3. <Participant, received, treatment>"}