{"My dad is sick, so I've been feeling not great lately.\n": "[]", "I've been having bad dreams, sometimes triggered by certain physical things or criticism in acting classes.\n": "1. <Participant, have, bad dreams>\n2. <Participant, be triggered by, certain physical things>\n3. <Participant, be triggered by, criticism in acting classes>", "I have a tendency to tell everyone everything, which has gotten me in trouble before.\n": "[]", "The last time I felt really happy was hanging out with friends the other night.\n": "[]", "I sometimes struggle to stand up for myself and internalize the idea of being too needy.\n": "1. <Participant, struggle, to stand up for myself>\n2. <Participant, internalize, the idea of being too needy>", "To relax, I take a bath, read a book, go out with friends, go to the theater, or do yoga.\n": "1. <I, take, a bath>\n2. <I, read, a book>\n3. <I, go out, with friends>\n4. <I, go, to the theater>\n5. <I, do, yoga>", "I don't consider myself an introvert because I usually have no trouble talking to people.\n": "[]", "When I'm annoyed, I argue my case or call my best friend to complain.\n": "1. <I, argue, my case>\n2. <I, call, my best friend>", "Injustice and entitlement make me really mad.\n": "No clear event related to the participant can be extracted from the given sentence.", "I live with my dad and brother, who are hoarders, because my dad is sick.\n": "1. <Participant, live with, dad and brother>", "I studied acting and theater and am still pursuing it.\n": "1. <Participant, studied, acting and theater>\n2. <Participant, am pursuing, acting and theater>", "I regret how I dealt with a friendship ending and committing to certain people I've dated.\n": "1. <Participant, regret, how they dealt with a friendship ending>\n2. <Participant, regret, committing to certain people they've dated>", "I had a traumatic situation where someone injured me, and I think I had PTSD, but I never saw a doctor.\n": "1. <someone, injured, Participant>", "I moved back to L.A. against my will because my dad was sick, which meant starting over in my career.\n": "1. <I, moved back, L.A.>\n2. <I, started over, my career>"}