{"I have always been a loner, trying to handle my own problems and situations.\n": "[]", "I have been feeling a little depressed lately, but I think everyone has a little bit of sadness in them at some point.\n": "[]", "I am originally from Los Angeles, California, and I really like the wonderful weather and outdoor activities there.\n": "[]", "I don't like how crowded and polluted Los Angeles is.\n": "[]", "I studied child communications in school.\n": "- <Participant, studied, child communications>", "I am currently working as a preschool teacher.\n": "- <Participant, working, preschool teacher>", "I have always worked with children since I was eighteen years old, and I believe in investing in the future by helping them.\n": "1. <Participant, worked with, children>\n2. <Participant, believe in, investing in the future>\n3. <Participant, helping, them>", "I cope with challenges day by day and have started an exercise program to look for solutions within myself.\n": "1. <I, cope with, challenges>\n2. <I, have started, exercise program>\n3. <I, look for, solutions within myself>", "I have always felt different since I was a child and realized I need to work on myself to understand who I am.\n": "1. <I, felt, different>\n2. <I, realized, need to work on myself>\n3. <I, understand, who I am>", "I felt really happy today because I got to see my best friend after a long time.\n": "- <I, got to see, my best friend>", "My mother and sisters have been positive influences in my life, with my mother inspiring me to become a school teacher.\n": "1. <my mother, inspire, me to become a school teacher>", "I am most proud of having such a wonderful mother, who was my first teacher and a significant influence in my life.\n": "[]", "I regret losing my mother, which is something I cannot control.\n": "[]", "I enjoy simple activities like riding my bike, going for walks with my sister, and exercising.\n": "1. <Participant, enjoy, riding my bike>\n2. <Participant, enjoy, going for walks with my sister>\n3. <Participant, enjoy, exercising>", "I like to play sports, go for walks, and be active for fun.\n": "1. <Participant, like, play sports>\n2. <Participant, like, go for walks>\n3. <Participant, like, be active>", "My dream job would be one where I could get paid well to be outside all day.\n": "[]", "I consider myself an introvert because I am quiet and enjoy doing activities by myself.\n": "[]", "I usually don't argue with people and prefer to walk away because arguments don't settle anything.\n": "[]", "I get really mad at racist or disrespectful people, and when annoyed, I shut down and reevaluate myself.\n": "1. <I, get mad, racist or disrespectful people>\n2. <I, shut down, when annoyed>\n3. <I, reevaluate, myself>", "I was diagnosed with depression less than a month ago and decided to seek help to evaluate myself as a person.\n": "1. <I, was diagnosed with, depression>\n2. <I, decided to seek, help>\n3. <I, evaluate, myself>"}