{"I argued with my sister because she's very controlling, and I felt like she was trying to tell me what to do with my life.\n": "1. <I, argued, with my sister>", "\n": "There is no conversation provided to extract events from. Please provide the text for analysis.", "Serving in the military made me more disciplined and motivated, helping me get things done even when I didn't want to.\n": "1. <Serving in the military, made, me more disciplined>\n2. <Serving in the military, made, me more motivated>\n3. <Serving in the military, helped, me get things done>", "I sought help because I was experiencing nightmares, anger issues, and depression, and I realized something wasn't right with me.\n": "1. <I, sought, help>", "I suffer from PTSD, which makes it difficult for me to get a good night's sleep due to recurring nightmares.\n": "1. <I, suffer from, PTSD>\n2. <PTSD, make, it difficult for me to get a good night's sleep>\n3. <PTSD, cause, recurring nightmares>", "I am proud of being self-motivated and able to accomplish things I once thought I couldn't.\n": "[]", "Recently, I enjoyed sitting down with my social worker to talk about getting things done in my life, including school.\n": "1. <I, enjoyed, sitting down with my social worker>\n2. <I, talk about, getting things done in my life>", "I started seeking help at the VA for my PTSD because I noticed it was triggered by something, though I'm not sure what.\n": "1. <I, started seeking, help at the VA>\n2. <I, noticed, it was triggered by something>", "I felt really happy this morning when I woke up and prayed, feeling connected with the universe.\n": "1. <Participant, felt, happy>\n2. <Participant, woke up, morning>\n3. <Participant, prayed, universe>", "When I'm annoyed, I tend to get really upset and start cussing people out, but I'm learning to let go and accept things I can't control.\n": "1. <I, get, upset>\n2. <I, start, cussing people out>\n3. <I, learn, let go>\n4. <I, accept, things I can't control>", "Going to therapy has helped me by allowing me to talk to a therapist about my situation, and I've been attending classes and one-on-one sessions with my doctor.\n": "1. <Participant, talk, therapist>\n2. <Participant, attend, classes>\n3. <Participant, attend, one-on-one sessions>"}