{"I argued with my parents about needing to be more self-sufficient and independent, especially regarding car issues and financial matters.\n": "1. <I, argued, with my parents>", "Over the past week, I've become a lot more positive after feeling like a hermit due to being in a new city and not knowing many people. Getting a job offer has boosted my confidence and positivity.\n": "1. <Participant, become, more positive>\n2. <Participant, feel, like a hermit>\n3. <Participant, get, a job offer>\n4. <Job offer, boost, Participant's confidence and positivity>", "I have traveled a lot in the past, working for Norwegian Cruise Line and going on an eleven-month mission trip around the world to help in different third-world countries.\n": "1. <Participant, traveled, a lot>\n2. <Participant, worked, Norwegian Cruise Line>\n3. <Participant, went, an eleven-month mission trip>\n4. <Participant, helped, different third-world countries>", "I recently went to explore a part of the South Bay area, went for a jog along the beach, and drove up a cliff to see beautiful scenery, which made me feel really happy.\n": "1. <Participant, went, South Bay area>\n2. <Participant, jog, beach>\n3. <Participant, drove, cliff>\n4. <Participant, see, scenery>\n5. <Participant, feel, happy>", "I went home to Oklahoma for Christmas, saw friends from college, and had a great time going out to dinner and having fun with them.\n": "1. <I, went, home to Oklahoma>\n2. <I, saw, friends from college>\n3. <I, had, a great time>\n4. <I, went, out to dinner>\n5. <I, had, fun>", "I studied psychology and minored in art, and I just got hired to work at a group home for teenage boys who have been in trouble with the law.\n": "1. <I, studied, psychology>\n2. <I, minored, art>\n3. <I, got hired, group home>", "I have been feeling really good lately after being unemployed for several months. Getting a job offer has relieved a lot of pressure and lifted my spirits.\n": "1. <Participant, have been feeling, really good>\n2. <Participant, getting, a job offer>\n3. <Job offer, has relieved, a lot of pressure>\n4. <Job offer, has lifted, my spirits>", "I moved to L.A. because I always wanted to live in California and be near the ocean, as I hated being landlocked in Oklahoma.\n": "1. <I, moved, L.A.>\n2. <I, wanted, live in California>\n3. <I, hated, being landlocked in Oklahoma>"}