{"I am currently managing a doggy day care facility.\n": "- <I, am managing, a doggy day care facility>", "My dream job is to own my own company again, probably working with animals.\n": "[]", "I was diagnosed with PTSD in February ": "- <Participant, was diagnosed with, PTSD>", "I was attacked by a stalker in November 2009, who broke into my apartment and tried to kill me.\n": "1. <stalker, attack, participant>\n2. <stalker, break into, participant's apartment>\n3. <stalker, try to kill, participant>", "I go to therapy and it has helped me handle things better, making me more rational and logical.\n": "1. <I, go, therapy>\n2. <therapy, helped, me>", "I cope with changes in behavior or thoughts by using resources learned in therapy and reaching out to others.\n": "1. <I, cope, changes in behavior or thoughts>\n2. <I, use, resources learned in therapy>\n3. <I, reach out, others>", "I studied journalism, English, music, and special effects makeup in school.\n": "1. <Participant, studied, journalism>\n2. <Participant, studied, English>\n3. <Participant, studied, music>\n4. <Participant, studied, special effects makeup>", "I regret not finishing school and would advise my younger self to stay focused on long-term goals.\n": "1. <Participant, regret, not finishing school>\n2. <Participant, advise, younger self>", "My father has been a positive influence in my life.\n": "No event related to the participant can be extracted from the given sentence.", "Being a parent is the hardest job, but it's the best because of the unconditional love from my children.\n": "No event related to the participant can be extracted from the given sentence.", "I recently enjoyed going to the beach with my oldest son and his best friend, riding three-wheel bikes.\n": "1. <I, enjoyed, going to the beach>\n2. <I, rode, three-wheel bikes>", "I am proud of my children, who are really good boys.\n": "[]", "I relax by drawing, painting, doing tattoos, and working with animals.\n": "1. <I, relax, by drawing>\n2. <I, relax, by painting>\n3. <I, relax, by doing tattoos>\n4. <I, relax, by working with animals>", "Therapy has been tremendously helpful for me to hold a job and be a productive member of society.\n": "1. <Therapy, has been, helpful>\n2. <Therapy, help, me hold a job>\n3. <Therapy, help, me be a productive member of society>"}