{"My husband told me I'm not the same person I was when we got married, and after my son was taken shortly after our wedding, I've been struggling to get back to who I was.\n": "1. <husband, told, me>", "I try to relax by meditating or going for walks, but I don't stick with it consistently.\n": "1. <I, try, relax>\n2. <I, meditate, >\n3. <I, go, walks>\n4. <I, don't stick, it>", "I feel a lot of stress and pressure about being a good parent and worry about the impact of my actions on my child's future.\n": "[]", "I'm on anti-depressants, specifically Wellbutrin, and I've been taking them for a couple of weeks. I think they're helping because I'm not as down as I was before.\n": "1. <Participant, be on, anti-depressants>\n2. <Participant, take, Wellbutrin>\n3. <Participant, think, they're helping>", "I have a temper and get angry more than most people do.\n": "[]", "I've written some children's books and am researching how to get them published. I've received positive feedback from critique groups.\n": "1. <Participant, write, children's books>\n2. <Participant, research, how to get them published>\n3. <Participant, receive, positive feedback>", "I cry a lot, especially at family events because my son isn't there, and I feel bad that I'm not the same person my husband married.\n": "1. <I, cry, a lot>\n2. <I, feel, bad>", "I'm looking for jobs and applied to go back to school at Dominguez Hills in the fall, trying to do more with my life.\n": "1. <Participant, look for, jobs>\n2. <Participant, apply, go back to school at Dominguez Hills>\n3. <Participant, try, do more with life>", "I take Benadryl to help me sleep, especially when I'm crying before bed.\n": "1. <I, take, Benadryl>\n2. <I, sleep, help>\n3. <I, cry, before bed>", "I feel disrespected and frustrated when people question my parenting skills, despite my efforts to be a good parent.\n": "[]", "I lost custody of my son and have been arguing with my stepmom and stepsister about how they treat him.\n": "1. <I, lost, custody of my son>\n2. <I, have been arguing, with my stepmom and stepsister>", "I enjoy going to events at USC like book signings and poetry readings.\n": "- <I, enjoy, going to events at USC>", "I still go to therapy, and it's helpful to have a set time each week to talk and cry.\n": "1. <I, go, therapy>\n2. <I, have, time>\n3. <I, talk, time>\n4. <I, cry, time>", "My ideal weekend involves reading, although I have a short attention span and can only read a few chapters at a time.\n": "1. <Participant, have, short attention span>\n2. <Participant, read, few chapters>", "I don't have anyone in my life who is a positive influence.\n": "[]"}