{"I moved to Los Angeles at the end of ": "Sorry, the input seems incomplete. Could you please provide more context or complete the sentence?", "I decided to go to film school after having an epiphany about my passion for movies.\n": "1. <I, decided, go to film school>", "The last time I argued with someone was with my mom about money.\n": "1. <Participant, argued, mom>", "I feel guilty sometimes for not being productive enough during my job hunting phase.\n": "[]", "I went to grad school at USC.\n": "- <Participant, went, grad school at USC>", "I like to travel, although I haven't been doing it a lot lately.\n": "[]", "I was coming out of a depression and felt safe and comfortable with my family.\n": "[]", "I still go to therapy and find it useful for self-awareness and understanding my patterns.\n": "1. <I, go, therapy>\n2. <I, find, it useful>", "To relax, I breathe deeply or watch a movie or TV show.\n": "1. <I, breathe, deeply>\n2. <I, watch, a movie>\n3. <I, watch, a TV show>", "I have been producing as a freelance producer for the last several years.\n": "1. <Participant, have been producing, as a freelance producer>", "I felt frustrated when my mom judged me unfairly.\n": "[]", "I value good sleep and feel cranky when I don't sleep well.\n": "[]", "Therapy has helped me focus on my patterns and responses to situations.\n": "- <Therapy, help, me>", "I have a good relationship with my family, although they live across the country.\n": "No clear event can be extracted from the given sentence as it is a statement about a relationship rather than an action.", "I sought help because I was at a low point and struggling with basic functioning.\n": "1. <I, sought, help>", "I was diagnosed with depression in October or November, and it was the second time in my life.\n": "[]", "I was unexpectedly phased out of a job by my boss, which made me feel angry and frustrated.\n": "1. <Participant, was phased out, job>\n2. <Participant, feel, angry>\n3. <Participant, feel, frustrated>"}