{"I was performing in a nightclub and had an opportunity to introduce myself to a very famous person, but I didn't do it.\n": "1. <I, was performing, in a nightclub>\n2. <I, had, an opportunity>\n3. <I, introduce, myself to a very famous person>\n4. <I, didn't do, it>", "I was in another business for twenty-five years, and now I'm finally pursuing acting because the economy makes it as easy to find work in show business as in other jobs I've done.\n": "1. <I, was in, another business>\n2. <I, am pursuing, acting>", "My wife and I have not been sleeping in the same bed for about three years, but we have a high-achieving daughter who is graduating from high school and has been accepted to a college with a nice scholarship.\n": "1. <Participant, have, high-achieving daughter>\n2. <Daughter, is graduating, high school>\n3. <Daughter, has been accepted, college>\n4. <Daughter, has, scholarship>", "I was diagnosed with depression about six years ago and see a therapist, though the current therapist is not prescribing medication.\n": "1. <Participant, was diagnosed with, depression>\n2. <Participant, see, therapist>", "I made a dessert to celebrate my daughter's scholarship, and it was delicious.\n": "1. <I, made, a dessert>", "I moved to L.A. from Minnesota thirty-one years ago, which is half my life.\n": "1. <I, moved, L.A.>", "I self-medicate to go to sleep, but often wake up earlier than I'd like to.\n": "1. <I, self-medicate, to go to sleep>\n2. <I, wake up, earlier than I'd like to>", "I started a business around twenty years ago, and while it was successful, I wish I had gotten it rolling more so it wouldn't be so dead today.\n": "1. <I, started, a business>", "I met a woman when I first moved out here, and she left me less than healthy physically.\n": "1. <I, met, a woman>\n2. <she, left, me>", "I cope pretty well, but I'm not as functional as I'd like to be, especially when I work late nights and don't get enough sleep.\n": "[]", "I feel anxious due to financial responsibilities and wanting to provide for my daughter, who has wealthy friends.\n": "1. <Participant, feel, anxious>", "I look forward to therapy because I feel like I'm talking to someone who understands me.\n": "1. <I, look forward to, therapy>\n2. <I, feel like, talking to someone who understands me>"}