{"I used to struggle with controlling my anger as a kid, but I've gotten better at managing it as an adult.\n": "1. <I, struggle with, controlling my anger>\n2. <I, get better at, managing it>", "I would advise my younger self to focus more on education rather than parties and socializing.\n": "[<Participant, advise, younger self>]", "I regret taking a long time to return to school for my degree and spending seven years with my ex-boyfriend.\n": "1. <I, regret, taking a long time to return to school>\n2. <I, regret, spending seven years with my ex-boyfriend>", "I wish I had handled a recent argument with my best friend differently by staying calm and suggesting we talk later.\n": "[]", "I love traveling and enjoy meeting new people and experiencing different cultures.\n": "1. <Participant, love, traveling>\n2. <Participant, enjoy, meeting new people>\n3. <Participant, enjoy, experiencing different cultures>", "I had a terrifying experience about fifteen years ago when a man tried to choke me at a party, and I wish I could erase it from my memory.\n": "1. <man, tried to choke, Participant>", "I felt really happy last weekend when I went to Santa Barbara with my husband and enjoyed wine tasting and the beach.\n": "1. <Participant, went, Santa Barbara>\n2. <Participant, enjoyed, wine tasting>\n3. <Participant, enjoyed, the beach>", "One of my most memorable experiences was visiting the pyramids in Teotihuacan, Mexico.\n": "[]", "I moved to L.A. about thirty-four years ago and try to visit my hometown once a year.\n": "1. <I, moved, L.A.>\n2. <I, try, visit my hometown>", "I have a good relationship with my family, especially with my sister, who I am very close to now.\n": "[]", "I went on a seven-day cruise to several Caribbean islands, which was an amazing experience.\n": "1. <I, went on, a seven-day cruise>\n2. <I, went to, several Caribbean islands>", "I studied history and am currently working in the education field.\n": "1. <I, studied, history>\n2. <I, am working, education field>", "I find social situations uncomfortable and feel awkward starting conversations.\n": "[]", "To relax, I enjoy reading and taking baths, and going to the gym helps me deal with stress.\n": "1. <I, enjoy, reading>\n2. <I, enjoy, taking baths>\n3. <going to the gym, helps, me>", "I am currently on vacation from work, which makes me feel good emotionally and physically.\n": "1. <I, am on, vacation>\n2. <vacation, makes, me feel good>"}