{"I studied everything at school because there isn't a subject I don't like.\n": "- <I, studied, everything at school>", "My dream job is working with computers and helping people because that's where my heart is.\n": "[]", "I meditate, work out, run, walk, write, and read.\n": "1. <Participant, meditate, >\n2. <Participant, work out, >\n3. <Participant, run, >\n4. <Participant, walk, >\n5. <Participant, write, >\n6. <Participant, read, >", "I spend my ideal weekend doing a little bit of everything, like rock climbing, biking, hiking, and going places with my daughter. I might also be skiing and snowboarding.\n": "1. <I, spend, weekend>\n2. <I, do, rock climbing>\n3. <I, do, biking>\n4. <I, do, hiking>\n5. <I, go, places with my daughter>\n6. <I, be, skiing>\n7. <I, be, snowboarding>", "My parent had a business in L.A., and it wasn't hard for me to get used to living there.\n": "[]", "I had a chance in school to go further, but I let something small and meaningless stop me.\n": "1. <I, had, a chance in school>\n2. <I, let, something small and meaningless stop me>", "I haven't been back to my hometown in over fifteen or sixteen years because I got stuck out here and then had my baby.\n": "1. <I, haven't been back, my hometown>  \n2. <I, got stuck, out here>  \n3. <I, had, my baby>", "I love my daughter; I cut her umbilical cord and put on her first shirt. She calmed down when I talked to her after she was born.\n": "1. <Participant, cut, her umbilical cord>\n2. <Participant, put on, her first shirt>\n3. <Participant, talked to, her>", "I feel like I have a wealth of potential within my grasp, but I need one connector to see what I'm capable of.\n": "- <I, feel, potential within my grasp>\n- <I, need, one connector>", "When I was younger, I saw things no child or adult should see, and I swore to take care of my child and not let her be around things like that.\n": "1. <I, swore, to take care of my child>", "I remember a trip to Mexico with my brother where we jumped into a lake off the side of a mountain.\n": "[]", "The last time I argued with someone was over a racial slur directed at my wife, which made me feel angry, upset, hurt, and disrespected.\n": "1. <Participant, argued, someone>", "I try to guard my baby more from things she sees, unlike my parents.\n": "1. <I, try to guard, my baby>", "I was diagnosed with depression, but I don't feel more depressed than any other person.\n": "[]", "My daughter's birthday is on the twenty-sixth.\n": "No event related to the participant can be extracted from the given sentence.", "I feel like my blood family and I don't talk, and my wife might not want to be with me, but I know my daughter loves me.\n": "1. <Participant, feel, blood family and I don't talk>\n2. <Participant, feel, wife might not want to be with me>\n3. <Participant, know, daughter loves me>"}