{"I was diagnosed twice, once back in 1972 or 1973, and then again about sixteen years ago.\n": "1. <I, was diagnosed, twice>", "I sought help because I felt things weren't going to change without it, and I thought medication might help me in the short term.\n": "1. <I, sought, help>\n2. <I, felt, things weren't going to change>\n3. <I, thought, medication might help me>", "I'm not going to therapy right now because I'm looking for a place to live and don't have a job, so things are a little shaky for me.\n": "1. <Participant, not going, therapy>\n2. <Participant, looking for, a place to live>\n3. <Participant, not have, a job>", "I had a hard time deciding to put my cat to sleep when he was sick, and it was also difficult to give up a cat when I was moving.\n": "1. <I, had, hard time deciding to put my cat to sleep>\n2. <I, give up, a cat when I was moving>", "I stopped going to therapy because I was moving around a lot, finances were tight, and I wasn't really feeling the need, but I'm starting to think it might be an option again.\n": "1. <I, stopped, going to therapy>\n2. <I, was moving, around a lot>\n3. <I, wasn't feeling, the need>\n4. <I, starting to think, it might be an option again>", "I was in a film class at junior college, and I never returned the film we worked on, which made me feel bad because they had to redo the work.\n": "1. <I, was in, a film class>\n2. <I, never returned, the film>\n3. <I, feel, bad>", "I wish I was a harder worker and willing to take low-wage jobs, and I have good ideas but struggle with follow-through.\n": "[]", "I would advise my younger self to go back to school, get my degree, work a regular job, and start saving for retirement.\n": "1. <Participant, advise, younger self to go back to school>\n2. <Participant, advise, younger self to get degree>\n3. <Participant, advise, younger self to work a regular job>\n4. <Participant, advise, younger self to start saving for retirement>", "I felt really happy last weekend on the beach, sitting in the sun, writing in my notebook, and feeling content.\n": "[]"}