{"I moved from Chicago, Illinois to another place when I was three years old.\n": "1. <Participant, moved, from Chicago>", "I never go back to my hometown due to family issues.\n": "1. <I, go back, my hometown>", "The last time I felt really happy was last night because the Lakers won the basketball game.\n": "[]", "I have traveled to Arizona, Stockton, California, and Barstow, California, but I don't do much traveling now mainly because of finances.\n": "1. <Participant, have traveled, Arizona>\n2. <Participant, have traveled, Stockton, California>\n3. <Participant, have traveled, Barstow, California>\n4. <Participant, don't do much traveling, now>", "I studied alcohol and drug counseling.\n": "1. <Participant, studied, alcohol and drug counseling>", "I had a big explosion with my mother's husband, which created a lot of damage for about six to nine months.\n": "[]", "I wish I had never gone to prison and could change my economic and employment status, as well as my teeth and physical size.\n": "[]", "I feel guilty about not spending more time with my grandfather before he passed away in ": "1. <Participant, feel guilty, not spending more time with grandfather>", "My brother is in prison, my sister moved to Chicago, and I haven't seen my son in five years. I'm only close to my mother.\n": "1. <Participant, be close to, mother>", "I mainly listen to music, watch YouTube, write poetry, and eat ice cream for leisure.\n": "1. <Participant, listen to, music>\n2. <Participant, watch, YouTube>\n3. <Participant, write, poetry>\n4. <Participant, eat, ice cream>", "I think about the day my brother hit my mom all the time and wish I could erase that memory.\n": "1. <Participant, think about, the day my brother hit my mom>\n2. <Participant, wish, erase that memory>", "I have a felony, which makes it hard to work with the youth and elderly, and I'm not certified yet as a counselor.\n": "1. <Participant, have, felony>\n2. <Felony, make, hard to work with the youth and elderly>\n3. <Participant, not certified, counselor>", "I moved away from my job because I was married and rent was cheaper elsewhere, but now I'm trying to get back into counseling.\n": "1. <I, moved away from, my job>\n2. <I, was married, >\n3. <I, am trying to get back into, counseling>", "I'm most proud of my mom for her achievements and positive influence on others.\n": "[]", "My dream job is to open my own facility or become an author.\n": "No clear event can be extracted from the given input."}