{"I often feel guilty when I yell at my children because I was yelled at a lot as a child, and I try hard to avoid handling situations with them in that way.\n": "1. <I, feel, guilty>\n2. <I, yell, at my children>\n3. <I, try, to avoid handling situations with them in that way>", "I have trouble sleeping on weekends because I worry about my older kids being out with their friends, and sometimes I get so exhausted from lack of sleep that I just pass out.\n": "1. <I, have trouble, sleeping on weekends>\n2. <I, worry, about my older kids being out with their friends>\n3. <I, get exhausted, from lack of sleep>\n4. <I, pass out, from exhaustion>", "I was pregnant and not married, and I had decided not to keep the pregnancy, but my partner wanted to have the child and marry me, which made the decision difficult. However, the hardest decision I ever made was whether to unplug my father's life support.\n": "1. <I, was, pregnant>\n2. <I, had decided, not to keep the pregnancy>\n3. <my partner, wanted, to have the child>\n4. <my partner, wanted, to marry me>\n5. <I, made, the hardest decision>\n6. <I, unplug, my father's life support>", "I was diagnosed with depression about three years ago, and my OB-GYN suggested I see a psychiatrist.\n": "1. <OB-GYN, suggest, Participant see a psychiatrist>", "I have three children, and I find parenting challenging because of the different stages they go through.\n": "1. <Participant, have, three children>\n2. <Participant, find, parenting challenging>", "I recently visited my son, who is dealing with legal issues and is currently incarcerated, and I felt happy that he was safe.\n": "1. <I, visited, my son>", "I am in the process of changing therapists because the program I was in lost funding, but therapy was an important part of my life and helped me cope.\n": "1. <Participant, is changing, therapists>\n2. <Program, lost, funding>\n3. <Therapy, helped, Participant cope>", "I enjoy designing jewelry to relax, and I am preparing to go back to work after staying home with my youngest child.\n": "1. <I, enjoy, designing jewelry>\n2. <I, am preparing, to go back to work>", "I recently argued with my husband about whether I ever thought about cheating, and I felt tired of discussing the same topic.\n": "1. <I, argued, with my husband>\n2. <I, felt tired, of discussing the same topic>", "I took a trip to Italy, which I enjoyed more the second time because I was better prepared for the culture.\n": "1. <I, took, trip to Italy>\n2. <I, enjoyed, trip more the second time>\n3. <I, was prepared, for the culture>", "I am very close to my family and consider myself outgoing, although I sometimes talk more than necessary.\n": "[]"}