{"I tend to have outbursts when things get too chaotic at home and I feel underappreciated.\n": "1. <I, have, outbursts>", "After an outburst, I isolate myself to relax and then return to deal with the situation calmly.\n": "1. <I, isolate, myself>\n2. <I, return, situation>", "I started in business but got disenchanted, so I studied philosophy in college, planning to go to law school and become a professor of ethics, but ended up joining the Peace Corps instead.\n": "1. <I, started, business>\n2. <I, got disenchanted, business>\n3. <I, studied, philosophy>\n4. <I, planned, go to law school>\n5. <I, planned, become a professor of ethics>\n6. <I, ended up joining, Peace Corps>", "I felt really happy when I got a new mattress and when I took the kids camping over spring break.\n": "1. <I, got, a new mattress>\n2. <I, took, the kids camping over spring break>", "I have a fish tank at home that I use to relax myself and my children when they get upset.\n": "1. <Participant, have, a fish tank>\n2. <Participant, use, fish tank>\n3. <Participant, relax, myself>\n4. <Participant, relax, my children>", "I find it difficult to manage my anger due to my upbringing, as my mother disconnected after my father died when I was young.\n": "1. <Participant, find, it difficult to manage anger>\n2. <Participant, have, upbringing>\n3. <Participant, experience, mother's disconnection>\n4. <Participant, have, father who died>", "I wish I had handled a situation differently when I had an outburst in the kitchen and banged a pot against the stove.\n": "1. <Participant, have, outburst>\n2. <Participant, bang, pot against the stove>", "I procrastinate a lot and often start projects without finishing them, but I'm working on completing them.\n": "1. <I, procrastinate, a lot>\n2. <I, start, projects>\n3. <I, work on, completing them>", "I traveled extensively during my time in the Peace Corps in South America and also spent a year in London.\n": "1. <I, traveled, extensively>\n2. <I, spent, a year in London>", "I've been an insomniac all my life and find it hard to sleep unless I'm physically and intellectually tired.\n": "1. <Participant, find, it hard to sleep>", "I wish I had pursued further education or career opportunities after the Peace Corps instead of resigning due to pregnancy.\n": "[]", "My dream job involves writing, teaching, and traveling overseas.\n": "[]", "I try to be a good mother, but I'm not a typical warm and fuzzy type; I'm more creative and do a lot of activities with my children.\n": "1. <I, try, to be a good mother>\n2. <I, am, more creative>\n3. <I, do, a lot of activities with my children>"}