{"I was on stage in Boston, and it was a great experience that I loved.\n": "1. <I, was on, stage in Boston>\n2. <I, loved, experience>", "I enjoy being with friends and laughing hysterically, which are some of my highest moments.\n": "1. <Participant, enjoy, being with friends>\n2. <Participant, enjoy, laughing hysterically>", "I find it hard to make decisions that have big consequences, especially if it means leaving my comfort zone or a relationship.\n": "[<Participant, find, it hard to make decisions>]", "I enjoy traveling and experiencing different cultures, like when I visited Europe and Mexico.\n": "- <I, enjoy, traveling>\n- <I, experience, different cultures>\n- <I, visit, Europe>\n- <I, visit, Mexico>", "I moved to L.A. originally for show business and to get away from Cleveland, but it was difficult to adjust at first.\n": "1. <I, moved, L.A.>\n2. <I, get away, Cleveland>", "I wish I could handle disappointing information better, like not being used for a job, without getting angry or feeling inadequate.\n": "[]", "I have difficulty sleeping due to pain in my back and neck, and sometimes I feel groggy and irritable during the day.\n": "1. <Participant, have, difficulty sleeping>\n2. <Participant, feel, groggy>\n3. <Participant, feel, irritable>", "I visited Sedona, which was a very mystical and energetic place, and it helped relieve my back pain.\n": "1. <I, visited, Sedona>\n2. <Sedona, helped relieve, my back pain>", "I am proud of becoming a more compassionate person over the past twenty years, which has made me happier.\n": "1. <I, am proud of, becoming a more compassionate person>", "I recently got angry during a trip to Vegas when the GPS led me the wrong way, but I calmed myself down quickly.\n": "1. <Participant, got angry, during a trip to Vegas>\n2. <GPS, led, Participant the wrong way>\n3. <Participant, calmed, myself down>", "I have been a Buddhist since 1988, and chanting helps me relax and center myself.\n": "1. <Participant, be, Buddhist>\n2. <Participant, chant, helps me relax and center myself>", "I don't have a dream job anymore; I prefer to relax and travel, enjoying creativity and independence.\n": "1. <Participant, prefer, to relax>\n2. <Participant, prefer, to travel>\n3. <Participant, enjoy, creativity>\n4. <Participant, enjoy, independence>", "I wish I could change the anger that sometimes wells up in me, but I know it happens less and less now.\n": "[]"}