{"I am trying to focus on my career goals, stop procrastinating, and get inspired by being around people who are doing what I want to do.\n": "1. <I, try, focus on my career goals>\n2. <I, stop, procrastinating>\n3. <I, get inspired, by being around people who are doing what I want to do>", "I had a fight with an ex-boyfriend that escalated unnecessarily, and I wish I had walked away from it.\n": "1. <I, had, fight with an ex-boyfriend>\n2. <fight, escalated, unnecessarily>\n3. <I, wish, walked away from it>", "I travel mostly to Boston and Florida to visit family, and I enjoy taking trips within California.\n": "1. <I, travel, Boston>\n2. <I, travel, Florida>\n3. <I, visit, family>\n4. <I, enjoy, taking trips within California>", "I relax by taking walks, listening to ambient music, and practicing deep breathing to return to a calm state.\n": "1. <I, relax, by taking walks>\n2. <I, relax, by listening to ambient music>\n3. <I, relax, by practicing deep breathing>", "I felt really happy recently when I visited my family and baby niece in Florida.\n": "1. <I, visited, my family and baby niece in Florida>", "I moved to L.A. to pursue acting and writing, and I found it easy to adjust because of the creative opportunities and the social culture.\n": "1. <I, moved, L.A.>\n2. <I, pursue, acting and writing>\n3. <I, found, it easy to adjust>", "I enjoy the creative freedom in L.A. and the ability to pursue any niche in art or entertainment.\n": "1. <I, enjoy, creative freedom in L.A.>\n2. <I, enjoy, ability to pursue any niche in art or entertainment>", "My dream job is to be a writer, possibly a writer/actress, but writing is my priority.\n": "[]", "I miss my family and feel that L.A. lacks a strong family element, which can make it feel crowded yet isolating.\n": "[]", "I worked on an acting series with a great group of people, which was a cool and inspiring creative experience.\n": "1. <I, worked on, an acting series>", "I had to walk away from a toxic person in my life, which was a difficult but necessary decision for long-term gain.\n": "1. <Participant, walk away from, toxic person>", "I have a wonderful family, including amazing parents, a brother, and a baby niece whom I love dearly.\n": "[]", "I studied communications with a concentration in public relations and an English minor to pursue writing.\n": "1. <I, studied, communications>\n2. <I, pursue, writing>", "I took a significant trip from Boston to San Francisco, L.A., and Las Vegas, which influenced my decision to move to L.A.\n": "1. <I, took, trip>\n2. <trip, influenced, decision>\n3. <I, move, L.A.>", "I regret not listening to my gut instincts and would advise my younger self not to second-guess myself.\n": "1. <I, regret, not listening to my gut instincts>\n2. <I, advise, my younger self not to second-guess myself>", "I had a public argument that got me in trouble, and I wish I could erase that incident.\n": "1. <I, had, public argument>\n2. <public argument, got, me in trouble>\n3. <I, wish, erase that incident>", "I had a relationship with a recent ex-boyfriend that made me feel bad about myself and realize I was allowing the wrong people into my life.\n": "1. <I, had, relationship>\n2. <relationship, made, me feel bad>\n3. <I, realize, I was allowing the wrong people into my life>", "I find it pretty easy to get a good night's sleep, although it's been a bit off lately.\n": "[]", "I am a great listener, have a constant sense of humor, and am comfortable around diverse people.\n": "[]"}