{"I always experience joy when I'm exercising at a very high level of exertion, like surfing, snowboarding, rock climbing, or mountain biking.\n": "[]", "I regret not getting married and having kids.\n": "[]", "My ex-boss used a lot of profanity toward me on my last day of work, and when I objected, he fired me. This happened a year and a half ago, and it's still on my mind.\n": "1. <ex-boss, used, profanity>\n2. <I, objected, profanity>\n3. <ex-boss, fired, me>", "I recently gave a rock climbing lesson, and the participants thanked me, saying it may have changed their lives, which was very gratifying.\n": "1. <participants, thanked, me>", "I received a diagnosis of cancer one month ago, and it's been affecting my sleep.\n": "1. <I, received, diagnosis of cancer>\n2. <it, been affecting, my sleep>", "I argued with my father for many months and years about pursuing medicine, but I eventually prevailed and didn't go that route, which was a difficult period in my life.\n": "1. <I, argued, with my father>\n2. <I, prevailed, and didn't go that route>", "I have a good relationship with my younger brother, but my older brother has psychological issues that affect me.\n": "1. <Participant, have, good relationship with younger brother>\n2. <Older brother, has, psychological issues>\n3. <Psychological issues, affect, Participant>", "I was pushed by my father to study biology, but now I work in business and am happy with that decision.\n": "1. <Participant, was pushed, to study biology>\n2. <Participant, work, in business>\n3. <Participant, am happy, with that decision>", "I wish I could submerge my hedonistic self.\n": "[]", "I enjoy traveling and experiencing different cultures, which has expanded my awareness.\n": "- <I, enjoy, traveling>\n- <I, enjoy, experiencing different cultures>\n- <traveling and experiencing different cultures, has expanded, my awareness>", "My father was a deferrer of gratification, focusing on the future, while I focus on the present.\n": "[]", "I visited an island off the coast of Fiji called Tavarua, which was an incredible experience.\n": "1. <I, visited, an island off the coast of Fiji called Tavarua>", "My brother is clinically depressed and has suicidal tendencies, which is difficult for me to cope with.\n": "[]", "I argued with my girlfriend about her lack of consideration, which left me feeling frustrated.\n": "1. <Participant, argued, girlfriend>", "In my later years, I've learned to vocalize my displeasure with others' actions, which helps manage my anger.\n": "1. <I, learned, vocalize my displeasure>\n2. <I, manage, my anger>", "I am devoted to the environment and have been vocal about being a steward against pollution.\n": "- <I, am devoted to, the environment>\n- <I, have been vocal about, being a steward against pollution>", "I try to enjoy life because you never know when it will end, especially with my cancer diagnosis.\n": "1. <I, try, enjoy life>"}