{"I was born in Hawaii but grew up in Colorado, and I moved to L.A. about seven to eight years ago for work. I love it here and try to go back to my hometown once or twice a year.\n": "1. <Participant, was born, Hawaii>\n2. <Participant, grew up, Colorado>\n3. <Participant, moved, L.A.>\n4. <Participant, try to go back, hometown>", "\n": "There is no conversation provided to extract events from. Please provide the conversation text.", "My grandmother was very positive and encouraging, always telling me to pursue my dreams and not let little things get me down.\n": "[]", "I felt like I wasn't being heard or listened to in a situation where we couldn't have a real dialogue.\n": "[]", "I got mad at someone at work about a month ago because I didn't think they were giving me clear instructions, and it led to both of us getting mad.\n": "1. <I, got mad, someone at work>\n2. <I, didn't think, they were giving me clear instructions>", "When I was a kid, someone put bandaids on my back with mean messages, and I walked around not knowing why people were laughing at me until someone told me.\n": "1. <someone, put, bandaids on my back>\n2. <I, walked, around>\n3. <someone, told, me>", "I wish I could erase the memory of when my grandfather found our dog run over, and it was a moment that frightened me and made me experience loss.\n": "[]", "I went to Alaska a couple of years ago, went fishing in the ocean, got seasick, and saw a bear in real life.\n": "1. <I, went, Alaska>\n2. <I, went, fishing>\n3. <I, got, seasick>\n4. <I, saw, bear>", "I went to Coachella, a music festival, with my friends and boyfriend, where we danced, swam, barbecued, and had a great time.\n": "1. <I, went, Coachella>\n2. <I, danced, >\n3. <I, swam, >\n4. <I, barbecued, >\n5. <I, had, a great time>", "I recently got a new job, which made me really happy.\n": "1. <Participant, got, a new job>", "I am proud of my career and sticking it out in L.A. despite the challenges, as I have always wanted to tell stories and work on writing.\n": "1. <I, am proud of, my career>\n2. <I, stick it out, in L.A.>\n3. <I, want, to tell stories>\n4. <I, want, to work on writing>", "I wish I had handled a situation differently when someone cut me off while driving, and I followed them to confront them, which was petty of me.\n": "1. <Participant, wish, handled a situation differently>\n2. <Someone, cut off, Participant>\n3. <Participant, followed, them>\n4. <Participant, confront, them>", "I have been between jobs recently, trying to manage my sleep schedule while not working, and I start a new job next week.\n": "1. <Participant, have been, between jobs>\n2. <Participant, try, manage my sleep schedule>\n3. <Participant, start, a new job next week>"}