{"I was born in Texas and moved to California when I was three, and I grew up in California.\n": "1. <Participant, was born, Texas>\n2. <Participant, moved, California>\n3. <Participant, grew up, California>", "I have four kids, and I hope I'm raising them right, guiding them through their journey in life, and leaving something worthwhile through them.\n": "1. <I, have, four kids>\n2. <I, hope, I'm raising them right>\n3. <I, guiding, them through their journey in life>\n4. <I, leaving, something worthwhile through them>", "I would have advised myself ten or twenty years ago to go to college right away instead of later in life.\n": "[]", "A couple of weeks or a month ago, my wife and I argued about expectations for a trip, and I ended up yelling at her because I felt attacked.\n": "1. <Participant, argued, about expectations for a trip>\n2. <Participant, yelled, at wife>", "Yesterday, my wife and I took our three younger girls to the park, and it was a happy time.\n": "[]", "I'm really close with my wife and daughters, but not as close with my brother due to his mental handicap.\n": "1. <Participant, be close with, wife>\n2. <Participant, be close with, daughters>\n3. <Participant, not be as close with, brother>", "My youth pastor in high school was a positive influence, inspiring me to study the Bible.\n": "[]", "I'm pursuing becoming a missionary, and my wife and I are planning to move to Ecuador for four years.\n": "1. <Participant, pursue, becoming a missionary>\n2. <Participant, plan, move to Ecuador>", "I spent a day with an Ecuadorian who only speaks Spanish, which was challenging due to my limited Spanish.\n": "1. <I, spent, a day with an Ecuadorian>", "I've been working nighttime shifts, which has made it hard for me to sleep.\n": "1. <Participant, work, nighttime shifts>\n2. <Working nighttime shifts, make, it hard for Participant to sleep>", "I decided to go to training last year because I felt God wanted me to pursue it, even though my wife initially disagreed.\n": "1. <I, decided, go to training>\n2. <I, felt, God wanted me to pursue it>", "God put a desire in my heart to do something for others, learn about other cultures, and share the gospel.\n": "[]", "At the end of March, I went to Ecuador for a week.\n": "1. <I, went, Ecuador>"}