{"I was always the low man on the totem pole socially in middle school, being the constant butt of jokes.\n": "[]", "When I was nineteen, I could just decide to do strange difficult things and had the boldness to follow through with them.\n": "[]", "I studied Hebrew and Semitic studies and classics at school.\n": "1. <I, studied, Hebrew and Semitic studies>\n2. <I, studied, classics>", "I'm in ministry, and it's working out the way I kind of want it to be.\n": "1. <Participant, be, in ministry>\n2. <ministry, work out, the way Participant wants>", "I'm better now that I'm not drinking as much pop at night.\n": "[]", "I've been making some better decisions with my diet, and it's doing better.\n": "1. <Participant, make, better decisions with diet>", "I have more standards and a willingness to enforce standards as a parent than my parents did.\n": "[]", "My wife has been a positive influence in my life, helping give me the self-confidence to be who I am.\n": "[]", "I've been able to maintain the standard and quality of life for myself and my family.\n": "- <Participant, maintain, standard and quality of life>", "It took a little while, but I got used to living in L.A.\n": "- <I, got used to, living in L.A.>", "I've been to Europe a couple of times and traveled around the country.\n": "1. <Participant, been to, Europe>\n2. <Participant, traveled around, country>", "I argued with my children about them not doing what they were told to do.\n": "1. <I, argued, with my children>", "I wish I had handled arguments with my wife more patiently and understandingly.\n": "[]", "Sometimes, I find it hard to be a parent, especially with character development.\n": "[]", "I talk to my parents about once a day or every other day and constantly talk with my wife and children.\n": "1. <I, talk, my parents>\n2. <I, talk, my wife>\n3. <I, talk, my children>", "I have four kids, and they keep me very busy; they're between nine and three.\n": "[<Participant, have, four kids>]", "I feel more empowered now that I'm making better choices with my diet and exercise.\n": "1. <I, feel, empowered>\n2. <I, am making, better choices>\n3. <I, am making, choices with my diet>\n4. <I, am making, choices with my exercise>", "I haven't been diagnosed with depression.\n": "[]", "I would advise my younger self not to fall into the trap of thinking that middle and high school is life.\n": "[]", "Visiting Yosemite and Sequoia parks was fun.\n": "[]", "I try to relax and breathe through situations and move on.\n": "1. <I, try, relax>\n2. <I, breathe, through situations>\n3. <I, move, on>", "I felt really happy a few weeks ago at the beach when everybody was having a good time.\n": "[]", "I haven't gone back to my hometown since I moved here, but I plan to later this year.\n": "- <Participant, plan, to go back to hometown>"}