{"I moved to Los Angeles in 1985 from Maryland.\n": "1. <I, moved, Los Angeles>", "I am proud of the fact that I don't give up.\n": "[]", "I am good at controlling my temper and know when it's appropriate to express it.\n": "[]", "My best friend would describe me as smart, well-dressed, and good at handling difficulties.\n": "No clear event related to the participant can be extracted from the given sentence.", "I have not had to make any very hard decisions in my life yet.\n": "[]", "I believe that everything that happens is under God's sovereignty and will work for my good.\n": "[]", "I am more outgoing but can be shy depending on the situation.\n": "No clear event can be extracted from the given sentence.", "To relax, I go to the movies.\n": "1. <I, go, movies>", "I had a disagreement with a woman at my church over micromanagement issues.\n": "- <Participant, have, disagreement with a woman at church>", "I wish I had handled a situation with a neighbor differently by ignoring them instead of responding.\n": "1. <I, wish, handled a situation differently>\n2. <I, wish, ignored them>\n3. <I, wish, responded>", "I was studying to be a nurse because I wanted a well-paying job that allowed me to use my service gift.\n": "1. <I, was studying, to be a nurse>  \n2. <I, wanted, a well-paying job>  \n3. <I, use, my service gift>", "My dream job is to create new technology that changes the world.\n": "[]", "I sleep well every night and have been feeling normal lately.\n": "[]", "I recently felt really happy participating in a Pentecost Sunday prayer session at my church.\n": "1. <Participant, felt, happy>\n2. <Participant, participated, Pentecost Sunday prayer session>", "I have not traveled much beyond local bus rides.\n": "[]", "I want to be a better person by improving my listening, communication, and acceptance of my strengths and weaknesses.\n": "1. <Participant, want, be a better person>\n2. <Participant, improve, listening>\n3. <Participant, improve, communication>\n4. <Participant, improve, acceptance of strengths and weaknesses>"}